{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report describing a fix for bouquet image loading with base‑path support and fallback behavior.",
  "frontend-file-summaries.txt": "Prewritten summaries for all frontend files, covering components, sections, hooks, assets, and configuration.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light/dark themes and global element resets.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Main app component assembling all sections, overlays, and global UI providers.",
  "frontend/src/components/AudioToggle.tsx": "Button-based audio controller that loads and toggles looping background music with error handling.",
  "frontend/src/components/BouquetRoses.tsx": "Grid of eight animated rose buttons that trigger rose note dialogs when clicked.",
  "frontend/src/components/HiddenMessage.tsx": "Hover/tap‑revealed tooltip-style message component with accessible interactions.",
  "frontend/src/components/LoveNoteDialog.tsx": "Dialog displaying the selected rose’s love note with themed styling.",
  "frontend/src/components/ReduceMotionToggle.tsx": "Toggle for enabling or disabling reduced-motion mode by adding a document-wide class.",
  "frontend/src/components/Reveal.tsx": "Wrapper that animates content into view using IntersectionObserver.",
  "frontend/src/components/RosePetalsOverlay.tsx": "Canvas animation of falling rose petals, disabled when reduced-motion is preferred.",
  "frontend/src/components/sections/EndingSection.tsx": "Final section with animated hearts and closing Rose Day message.",
  "frontend/src/components/sections/LandingSection.tsx": "Intro section with animated heart, romantic text, and hidden message interaction.",
  "frontend/src/components/sections/LoveNoteSection.tsx": "Displays a styled love letter section pulling title, paragraphs, and signature from roseDayCopy with reveal animation.",
  "frontend/src/components/sections/VirtualRoseGiftSection.tsx": "Shows a virtual rose bouquet with selectable roses that open love notes, handling image errors and using modal dialog.",
  "frontend/src/components/sections/WhyFavoriteSection.tsx": "Renders a list of reasons from roseDayCopy with reveal effects and a hidden message component.",
  "frontend/src/content/roseDayCopy.ts": "Provides all static copy for the site including landing text, reasons, virtual gift messages, rose notes, and love letter content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, stored identity loading, and exposing identity state and helpers.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Hook that tracks system reduced‑motion preference via matchMedia.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are needed.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Hook using IntersectionObserver to report visibility of an element for reveal animations.",
  "frontend/src/index.css": "Tailwind setup plus custom variables, themes, motion‑reduction rules, background, and utility animations.",
  "frontend/src/lib/assetUrl.ts": "Builds asset URLs respecting Vite's BASE_URL and normalizing paths.",
  "frontend/src/main.tsx": "Bootstraps the app, wrapping it with React Query and Internet Identity providers before rendering.",
  "frontend/tailwind.config.js": "Configures Tailwind with typography, container queries, custom fonts, OKLCH color palette, extended border radii, and shadows.",
  "project_state.json": "Defines project state, requirements, romantic website goals, known issues, and existing feature specifications for the Rose Day site."
}